export const cascaderOptions = [
    {
        "value": "免疫学发展简史",
        "label": "免疫学发展简史",
        "children": [
            {
                "value": "免疫学的经验时期",
                "label": "免疫学的经验时期"
            },
            {
                "value": "经典免疫学时期",
                "label": "经典免疫学时期"
            },
            {
                "value": "近代免疫学时期",
                "label": "近代免疫学时期"
            },
            {
                "value": "现代免疫学时期",
                "label": "现代免疫学时期"
            },
            {
                "value": "免疫学在生物学和医学发展中的作用",
                "label": "免疫学在生物学和医学发展中的作用"
            }
        ]
    },
    {
        "value": "免疫系统的组织结构",
        "label": "免疫系统的组织结构"
    },
    {
        "value": "免疫球蛋白分子",
        "label": "免疫球蛋白分子",
        "children": [
            {
                "value": "抗体的发现及其特性",
                "label": "抗体的发现及其特性"
            },
            {
                "value": "免疫球蛋白分子的结构与功能",
                "label": "免疫球蛋白分子的结构与功能",
                "children": [
                    {
                        "value": "免疫球蛋白分子的基本结构",
                        "label": "免疫球蛋白分子的基本结构"
                    },
                    {
                        "value": "免疫球蛋白分子的功能",
                        "label": "免疫球蛋白分子的功能"
                    },
                    {
                        "value": "免疫球蛋白分子的抗原性",
                        "label": "免疫球蛋白分子的抗原性"
                    },
                    {
                        "value": "免疫球蛋白分子的超家族",
                        "label": "免疫球蛋白分子的超家族"
                    }
                ]
            },
            {
                "value": "各类免疫球蛋白的生物学活性",
                "label": "各类免疫球蛋白的生物学活性"
            },
            {
                "value": "免疫球蛋白基因的结构和抗体多样性",
                "label": "免疫球蛋白基因的结构和抗体多样性"
            },
            {
                "value": "抗体的制备",
                "label": "抗体的制备",
                "children": [
                    {
                        "value": "多克隆抗体",
                        "label": "多克隆抗体"
                    },
                    {
                        "value": "单克隆抗体",
                        "label": "单克隆抗体"
                    },
                    {
                        "value": "基因工程抗体",
                        "label": "基因工程抗体"
                    }
                ]
            }
        ]
    },
    {
        "value": "补体系统",
        "label": "补体系统",
        "children": [
            {
                "value": "补体系统的组成和理化性质",
                "label": "补体系统的组成和理化性质"
            },
            {
                "value": "补体系统的激活",
                "label": "补体系统的激活"
            },
            {
                "value": "补体受体及其免疫学功能",
                "label": "补体受体及其免疫学功能"
            },
            {
                "value": "补体的生物学活性",
                "label": "补体的生物学活性"
            },
            {
                "value": "血清补体水平与疾病",
                "label": "血清补体水平与疾病"
            }
        ]
    },
    {
        "value": "细胞因子",
        "label": "细胞因子",
        "children": [
            {
                "value": "细胞因子及其受体的结构",
                "label": "细胞因子及其受体的结构"
            },
            {
                "value": "细胞因子的生物学活性",
                "label": "细胞因子的生物学活性",
                "children": [
                    {
                        "value": "免疫细胞的调节剂",
                        "label": "免疫细胞的调节剂"
                    },
                    {
                        "value": "免疫效应分子",
                        "label": "免疫效应分子"
                    },
                    {
                        "value": "造血细胞刺激剂",
                        "label": "造血细胞刺激剂"
                    },
                    {
                        "value": "炎症反应的促进剂",
                        "label": "炎症反应的促进剂"
                    },
                    {
                        "value": "其它",
                        "label": "其它"
                    }
                ]
            },
            {
                "value": "细胞因子的临床意义",
                "label": "细胞因子的临床意义"
            }
        ]
    },
    {
        "value": "免疫细胞膜分子（一）：主要组织兼容性抗原",
        "label": "免疫细胞膜分子（一）：主要组织兼容性抗原",
        "children": [
            {
                "value": "MHC基因结构",
                "label": "MHC基因结构",
                "children": [
                    {
                        "value": "小鼠H-2基因复合体",
                        "label": "小鼠H-2基因复合体"
                    },
                    {
                        "value": "人类HLA基因复合体",
                        "label": "人类HLA基因复合体"
                    }
                ]
            },
            {
                "value": "MHC抗原",
                "label": "MHC抗原"
            },
            {
                "value": "MHC分子的功能",
                "label": "MHC分子的功能"
            },
            {
                "value": "HLA的医学意义",
                "label": "HLA的医学意义"
            },
            {
                "value": "HLA分型技术",
                "label": "HLA分型技术",
                "children": [
                    {
                        "value": "血清学分型技术",
                        "label": "血清学分型技术"
                    },
                    {
                        "value": "细胞学分型技术",
                        "label": "细胞学分型技术"
                    },
                    {
                        "value": "HLA的DNA分型技术",
                        "label": "HLA的DNA分型技术"
                    }
                ]
            }
        ]
    },
    {
        "value": "免疫细胞膜分子（二）：白细胞分化抗原",
        "label": "免疫细胞膜分子（二）：白细胞分化抗原",
        "children": [
            {
                "value": "白细胞分化抗原",
                "label": "白细胞分化抗原",
                "children": [
                    {
                        "value": "人白细胞分化抗原",
                        "label": "人白细胞分化抗原"
                    },
                    {
                        "value": "小鼠白细胞分化抗原",
                        "label": "小鼠白细胞分化抗原"
                    }
                ]
            },
            {
                "value": "粘附分子",
                "label": "粘附分子",
                "children": [
                    {
                        "value": "粘合素超家族",
                        "label": "粘合素超家族"
                    },
                    {
                        "value": "免疫球蛋白超家族",
                        "label": "免疫球蛋白超家族"
                    },
                    {
                        "value": "选择素家庭",
                        "label": "选择素家庭"
                    },
                    {
                        "value": "钙离子依赖的粘附分子家族",
                        "label": "钙离子依赖的粘附分子家族"
                    },
                    {
                        "value": "其它未归类的粘附分子",
                        "label": "其它未归类的粘附分子"
                    }
                ]
            },
            {
                "value": "其它免疫细胞膜分子",
                "label": "其它免疫细胞膜分子",
                "children": [
                    {
                        "value": "促有丝分裂原受体",
                        "label": "促有丝分裂原受体"
                    },
                    {
                        "value": "Ig Fe受体",
                        "label": "Ig Fe受体"
                    },
                    {
                        "value": "细胞因子受体",
                        "label": "细胞因子受体"
                    },
                    {
                        "value": "羊红细胞受体",
                        "label": "羊红细胞受体"
                    },
                    {
                        "value": "补体受体",
                        "label": "补体受体"
                    },
                    {
                        "value": "内分泌激素、神经递质和神经肽胺体",
                        "label": "内分泌激素、神经递质和神经肽胺体"
                    }
                ]
            }
        ]
    },
    {
        "value": "免疫细胞（一）：造血干细胞",
        "label": "免疫细胞（一）：造血干细胞",
        "children": [
            {
                "value": "造血干细胞的特性",
                "label": "造血干细胞的特性"
            },
            {
                "value": "造血干细胞的分化",
                "label": "造血干细胞的分化",
                "children": [
                    {
                        "value": "多能干细胞",
                        "label": "多能干细胞"
                    },
                    {
                        "value": "单能干细胞",
                        "label": "单能干细胞"
                    }
                ]
            },
            {
                "value": "造血干细胞与淋巴细胞的发生",
                "label": "造血干细胞与淋巴细胞的发生"
            }
        ]
    },
    {
        "value": "免疫细胞（二）：淋巴细胞系",
        "label": "免疫细胞（二）：淋巴细胞系",
        "children": [
            {
                "value": "T细胞",
                "label": "T细胞",
                "children": [
                    {
                        "value": "T细胞主要表面分子",
                        "label": "T细胞主要表面分子"
                    },
                    {
                        "value": "T细胞亚群的分类及功能",
                        "label": "T细胞亚群的分类及功能"
                    },
                    {
                        "value": "T细胞在胸腺内的发育",
                        "label": "T细胞在胸腺内的发育"
                    }
                ]
            },
            {
                "value": "B细胞",
                "label": "B细胞",
                "children": [
                    {
                        "value": "B细胞膜主要表面分子",
                        "label": "B细胞膜主要表面分子"
                    },
                    {
                        "value": "B细胞亚类",
                        "label": "B细胞亚类"
                    },
                    {
                        "value": "B细胞的发育",
                        "label": "B细胞的发育"
                    }
                ]
            },
            {
                "value": "第三群淋巴细胞",
                "label": "第三群淋巴细胞",
                "children": [
                    {
                        "value": "自然杀伤细胞",
                        "label": "自然杀伤细胞"
                    },
                    {
                        "value": "淋巴因子活化的杀伤细胞",
                        "label": "淋巴因子活化的杀伤细胞"
                    },
                    {
                        "value": "肿瘤浸润淋巴细胞",
                        "label": "肿瘤浸润淋巴细胞"
                    }
                ]
            }
        ]
    },
    {
        "value": "免疫细胞（三）：单核吞噬细胞系统",
        "label": "免疫细胞（三）：单核吞噬细胞系统",
        "children": [
            {
                "value": "单核吞噬细胞系统",
                "label": "单核吞噬细胞系统"
            },
            {
                "value": "其他抗原呈递细胞",
                "label": "其他抗原呈递细胞",
                "children": [
                    {
                        "value": "树突状细胞",
                        "label": "树突状细胞"
                    },
                    {
                        "value": "抗原呈递细胞-B细胞",
                        "label": "抗原呈递细胞-B细胞"
                    },
                    {
                        "value": "内皮细胞及其他抗原呈递细胞",
                        "label": "内皮细胞及其他抗原呈递细胞"
                    }
                ]
            },
            {
                "value": "抗原呈递细胞的抗原呈递作用",
                "label": "抗原呈递细胞的抗原呈递作用"
            }
        ]
    },
    {
        "value": "免疫应答",
        "label": "免疫应答"
    },
    {
        "value": "抗原",
        "label": "抗原",
        "children": [
            {
                "value": "抗原的特性",
                "label": "抗原的特性"
            },
            {
                "value": "抗原的免疫原性",
                "label": "抗原的免疫原性"
            },
            {
                "value": "抗原的抗原性",
                "label": "抗原的抗原性",
                "children": [
                    {
                        "value": "人工结合抗原",
                        "label": "人工结合抗原"
                    },
                    {
                        "value": "载体决定簇与半抗原决定簇",
                        "label": "载体决定簇与半抗原决定簇"
                    },
                    {
                        "value": "天然蛋白质的抗原性",
                        "label": "天然蛋白质的抗原性"
                    }
                ]
            },
            {
                "value": "抗原的分类",
                "label": "抗原的分类",
                "children": [
                    {
                        "value": "天然抗原",
                        "label": "天然抗原"
                    },
                    {
                        "value": "人工抗原",
                        "label": "人工抗原"
                    },
                    {
                        "value": "胸腺依赖抗原与胸腺非依赖抗原",
                        "label": "胸腺依赖抗原与胸腺非依赖抗原"
                    },
                    {
                        "value": "超抗原",
                        "label": "超抗原"
                    }
                ]
            }
        ]
    },
    {
        "value": "免疫应答（一）：B细胞介导的体液免疫",
        "label": "免疫应答（一）：B细胞介导的体液免疫",
        "children": [
            {
                "value": "免疫应答的概念与过程",
                "label": "免疫应答的概念与过程"
            },
            {
                "value": "抗体产生的细胞学基础",
                "label": "抗体产生的细胞学基础"
            },
            {
                "value": "抗体形成过程中免疫细胞间的相互作用",
                "label": "抗体形成过程中免疫细胞间的相互作用",
                "children": [
                    {
                        "value": "巨噬细胞与TH细胞之间的相互作用",
                        "label": "巨噬细胞与TH细胞之间的相互作用"
                    },
                    {
                        "value": "TH细胞与B细胞之间的相互作用",
                        "label": "TH细胞与B细胞之间的相互作用"
                    },
                    {
                        "value": "巨噬细胞与B细胞的相互作用",
                        "label": "巨噬细胞与B细胞的相互作用"
                    }
                ]
            },
            {
                "value": "免疫记忆",
                "label": "免疫记忆"
            },
            {
                "value": "体液免疫的效应",
                "label": "体液免疫的效应"
            },
            {
                "value": "体液免疫应答的调节",
                "label": "体液免疫应答的调节"
            }
        ]
    },
    {
        "value": "免疫应答（二）：T细胞介导的细胞免疫",
        "label": "免疫应答（二）：T细胞介导的细胞免疫",
        "children": [
            {
                "value": "细胞免疫的概念",
                "label": "细胞免疫的概念"
            },
            {
                "value": "CD4+T细胞介导的细胞免疫",
                "label": "CD4+T细胞介导的细胞免疫",
                "children": [
                    {
                        "value": "CD4+T细胞在DTH反应中的作用",
                        "label": "CD4+T细胞在DTH反应中的作用"
                    },
                    {
                        "value": "CD4+T细胞的活化",
                        "label": "CD4+T细胞的活化"
                    },
                    {
                        "value": "迟发型超敏性炎症的形成",
                        "label": "迟发型超敏性炎症的形成"
                    }
                ]
            },
            {
                "value": "CD8+T（TC）T细胞介导的细胞免疫",
                "label": "CD8+T（TC）T细胞介导的细胞免疫",
                "children": [
                    {
                        "value": "CD8+T（TC）T细胞的活化",
                        "label": "CD8+T（TC）T细胞的活化"
                    },
                    {
                        "value": "TC细胞杀伤靶细胞的机制",
                        "label": "TC细胞杀伤靶细胞的机制"
                    }
                ]
            }
        ]
    },
    {
        "value": "免疫应答（三）：免疫耐受",
        "label": "免疫应答（三）：免疫耐受",
        "children": [
            {
                "value": "免疫耐受现象的发现",
                "label": "免疫耐受现象的发现"
            },
            {
                "value": "影响免疫耐受形成的因素",
                "label": "影响免疫耐受形成的因素"
            },
            {
                "value": "免疫耐受的维持和终止",
                "label": "免疫耐受的维持和终止"
            },
            {
                "value": "免疫耐受的机制",
                "label": "免疫耐受的机制",
                "children": [
                    {
                        "value": "克隆清除",
                        "label": "克隆清除"
                    },
                    {
                        "value": "克隆不应答",
                        "label": "克隆不应答"
                    },
                    {
                        "value": "抑制细胞的作用",
                        "label": "抑制细胞的作用"
                    }
                ]
            },
            {
                "value": "免疫耐受的临床意义",
                "label": "免疫耐受的临床意义"
            }
        ]
    },
    {
        "value": "免疫应答（四）：免疫调节",
        "label": "免疫应答（四）：免疫调节",
        "children": [
            {
                "value": "免疫系统的调节",
                "label": "免疫系统的调节"
            },
            {
                "value": "遗传对免疫应答的调节",
                "label": "遗传对免疫应答的调节"
            },
            {
                "value": "神经内分泌免疫网络调节",
                "label": "神经内分泌免疫网络调节"
            }
        ]
    },
    {
        "value": "超敏反应",
        "label": "超敏反应",
        "children": [
            {
                "value": "Ⅰ型超敏反应",
                "label": "Ⅰ型超敏反应"
            },
            {
                "value": "Ⅱ型超敏反应",
                "label": "Ⅱ型超敏反应"
            },
            {
                "value": "Ⅲ型超敏反应",
                "label": "Ⅲ型超敏反应"
            },
            {
                "value": "Ⅳ型超敏反应",
                "label": "Ⅳ型超敏反应"
            }
        ]
    },
    {
        "value": "自身免疫和自身免疫病",
        "label": "自身免疫和自身免疫病",
        "children": [
            {
                "value": "生理性自身免疫现象",
                "label": "生理性自身免疫现象"
            },
            {
                "value": "病理性自身免疫应答的诱因",
                "label": "病理性自身免疫应答的诱因"
            },
            {
                "value": "病理性自身免疫发生机制",
                "label": "病理性自身免疫发生机制"
            },
            {
                "value": "自身免疫性疾病",
                "label": "自身免疫性疾病"
            },
            {
                "value": "自身免疫病治疗原则" ,
                "label": "自身免疫病治疗原则"
            }
        ]
    },
    {
        "value": "免疫缺陷",
        "label": "免疫缺陷",
        "children": [
            {
                "value": "免疫缺陷病的分类",
                "label": "免疫缺陷病的分类",
                "children": [
                    {
                        "value": "原发性免疫缺陷病",
                        "label": "原发性免疫缺陷病"
                    },
                    {
                        "value": "继发性免疫缺陷病概况",
                        "label": "继发性免疫缺陷病概况"
                    }
                ]
            },
            {
                "value": "免疫缺陷病的一般特征",
                "label": "免疫缺陷病的一般特征"
            },
            {
                "value": "常见的原发性免疫缺陷病",
                "label": "常见的原发性免疫缺陷病",
                "children": [
                    {
                        "value": "B细胞缺陷性疾病",
                        "label": "B细胞缺陷性疾病"
                    },
                    {
                        "value": "T细胞缺陷性疾病",
                        "label": "T细胞缺陷性疾病"
                    },
                    {
                        "value": "T和B细胞联合缺陷性疾病",
                        "label": "T和B细胞联合缺陷性疾病"
                    },
                    {
                        "value": "吞噬细胞缺陷病",
                        "label": "吞噬细胞缺陷病"
                    },
                    {
                        "value": "补体缺陷病",
                        "label": "补体缺陷病"
                    }
                ]
            },
            {
                "value": "继发性免疫缺陷病",
                "label": "继发性免疫缺陷病"
            }
        ]
    },
    {
        "value": "肿瘤免疫",
        "label": "肿瘤免疫",
        "children": [
            {
                "value": "肿瘤抗原",
                "label": "肿瘤抗原"
            },
            {
                "value": "机体抗肿瘤免疫的机制",
                "label": "机体抗肿瘤免疫的机制"
            },
            {
                "value": "肿瘤的免疫学检测",
                "label": "肿瘤的免疫学检测"
            },
            {
                "value": "肿瘤的免疫治疗",
                "label": "肿瘤的免疫治疗"
            }
        ]
    },
    {
        "value": "移植免疫",
        "label": "移植免疫",
        "children": [
            {
                "value": "器官移植排斥的类型",
                "label": "器官移植排斥的类型"
            },
            {
                "value": "移植反排斥的机制",
                "label": "移植反排斥的机制"
            },
            {
                "value": "移植排斥的防止",
                "label": "移植排斥的防止"
            }
        ]
    },
    {
        "value": "免疫学检测法",
        "label": "免疫学检测法",
        "children": [
            {
                "value": "抗原或抗体的检测",
                "label": "抗原或抗体的检测",
                "children": [
                    {
                        "value": "检测的原理",
                        "label": "检测的原理"
                    },
                    {
                        "value": "抗原或抗体检测的实用意义",
                        "label": "抗原或抗体检测的实用意义"
                    },
                    {
                        "value": "抗原或抗体检测的方法",
                        "label": "抗原或抗体检测的方法"
                    },
                    {
                        "value": "用标记抗体或抗原进行的抗原、抗体反应",
                        "label": "用标记抗体或抗原进行的抗原、抗体反应"
                    }
                ]
            },
            {
                "value": "体液免疫功能的检测",
                "label": "体液免疫功能的检测"
            },
            {
                "value": "细胞免疫功能的检测",
                "label": "细胞免疫功能的检测"
            },
            {
                "value": "分子生物学技术在免疫学诊断中的应用",
                "label": "分子生物学技术在免疫学诊断中的应用"
            }
        ]
    },
    {
        "value": "免疫治疗学",
        "label": "免疫治疗学",
        "children": [
            {
                "value": "免疫增强药物及免疫增强疗法",
                "label": "免疫增强药物及免疫增强疗法"
            },
            {
                "value": "免疫抑制剂及免疫抑制疗法",
                "label": "免疫抑制剂及免疫抑制疗法"
            },
            {
                "value": "生物应答调节与免疫治疗",
                "label": "生物应答调节与免疫治疗"
            }
        ]
    }
]